# GetExternalResourceReferences Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Element..::..GetExternalResourceReferences Method
Element Class See Also
---
Gets the map of the external resource references referenced by the element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public IDictionary<ExternalResourceType, ExternalResourceReference> GetExternalResourceReferences()
```

Visual Basic
---
```text
Public Function GetExternalResourceReferences As IDictionary(Of ExternalResourceType, ExternalResourceReference)
```

Visual C++
---
```text
public:
IDictionary<ExternalResourceType^, ExternalResourceReference^>^ GetExternalResourceReferences()
```

# ### Return Value
The map of the external resource references referenced by the element.
# Remarks
For an element which has multiple external resource references under a specified type like AppearanceAssetElement, the first one will be the value in the map. See also: [!:Autodesk::Revit::DB::Element::getExternalResourceReferencesExpanded].
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This Element does not use any external resource. |

# See Also
Element Class
Autodesk.Revit.DB Namespace